<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="?,3,736,992" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="/Constant_30_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 4" offset="0" size="8" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/Constant_30" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Constant_30_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_17_output_0" />
			</output>
		</layer>
		<layer id="4" name="Constant_42783_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="16" size="6" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_42783" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Multiply_42785" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_42787_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="22" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_42787" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Divide_20989" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="onnx::Conv_2290_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="28" size="1728" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="onnx::Conv_2290" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2290">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/backbone/init_block/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_178_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1756" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_178" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone/init_block/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/init_block/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/backbone/init_block/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/init_block/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="onnx::Conv_2293_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="1820" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="onnx::Conv_2293" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2293">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/backbone/stage1/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_198_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="3868" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_198" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/backbone/stage1/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/backbone/stage1/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_213_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="3932" size="576" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_213" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/backbone/stage1/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Reshape_265_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="4508" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_265" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/backbone/stage1/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/stage1/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="onnx::Conv_2299_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="4572" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="onnx::Conv_2299" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2299">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/backbone/stage1/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_285_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5596" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_285" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/backbone/stage1/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="onnx::Conv_2302_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 16, 1, 1" offset="5628" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="onnx::Conv_2302" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2302">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/backbone/stage2/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_301_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="8700" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Reshape_301" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/backbone/stage2/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/backbone/stage2/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_316_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 1, 1, 3, 3" offset="8892" size="1728" />
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_316" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/backbone/stage2/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_368_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="10620" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Reshape_368" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/backbone/stage2/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/backbone/stage2/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit1/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="onnx::Conv_2308_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 96, 1, 1" offset="10812" size="4608" />
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="onnx::Conv_2308" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2308">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/backbone/stage2/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_388_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="15420" size="48" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_388" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/backbone/stage2/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Conv_2311_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="15468" size="6912" />
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="onnx::Conv_2311" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2311">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/backbone/stage2/unit2/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_404_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="22380" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Reshape_404" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/backbone/stage2/unit2/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/stage2/unit2/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit2/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_419_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="22668" size="2592" />
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_419" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/stage2/unit2/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_471_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="25260" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_471" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/backbone/stage2/unit2/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/backbone/stage2/unit2/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit2/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx::Conv_2317_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="25548" size="6912" />
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="onnx::Conv_2317" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2317">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/backbone/stage2/unit2/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_491_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="32460" size="48" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_491" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/backbone/stage2/unit2/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/backbone/stage2/unit2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/Add_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx::Conv_2320_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="32508" size="6912" />
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="onnx::Conv_2320" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2320">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/backbone/stage3/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Reshape_508_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="39420" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_508" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/stage3/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/backbone/stage3/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Reshape_523_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="39708" size="2592" />
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_523" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/backbone/stage3/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_575_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="42300" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_575" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/backbone/stage3/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/stage3/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit1/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="onnx::Conv_2326_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 144, 1, 1" offset="42588" size="9216" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="onnx::Conv_2326" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2326">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/backbone/stage3/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_595_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="51804" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_595" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/backbone/stage3/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="onnx::Conv_2329_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 32, 1, 1" offset="51868" size="12288" />
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="onnx::Conv_2329" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_2329">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/backbone/stage3/unit2/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_611_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1, 1" offset="64156" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Reshape_611" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/backbone/stage3/unit2/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit2/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/backbone/stage3/unit2/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
