<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_5637_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="0" size="6" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_5637" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Multiply_5813" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_5815_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="6" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_5815" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Divide_2331" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="onnx::Conv_919_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 3, 3" offset="12" size="864" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="onnx::Conv_919" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_919">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/backbone/features/features.0/features.0.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_146_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="876" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_146" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/backbone/features/features.0/features.0.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.0/features.0.0/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_5970_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="908" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_5970" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone/features/features.0/features.0.2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.0/features.0.2/Add_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/backbone/features/features.0/features.0.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/features/features.0/features.0.2/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/backbone/features/features.0/features.0.2/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/features/features.0/features.0.2/Clip_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/backbone/features/features.0/features.0.2/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.0/features.0.2/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_5971_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="910" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_5971" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/backbone/features/features.0/features.0.2/Div" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.0/features.0.2/Div_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_167_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 3, 3" offset="912" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_167" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/backbone/features/features.1/conv/conv.0/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_219_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="1200" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_219" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/features/features.1/conv/conv.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.1/conv/conv.0/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/backbone/features/features.1/conv/conv.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/features/features.1/conv/conv.2/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="onnx::Conv_925_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 1, 1" offset="1232" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="onnx::Conv_925" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_925">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/backbone/features/features.1/conv/conv.4/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_236_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="1744" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_236" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/features/features.1/conv/conv.4/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.1/conv/conv.4/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/features/features.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.1/Add_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="onnx::Conv_928_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 16, 1, 1" offset="1776" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="onnx::Conv_928" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_928">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/backbone/features/features.2/conv/conv.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_253_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="3824" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_253" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/backbone/features/features.2/conv/conv.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.2/conv/conv.0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/backbone/features/features.2/conv/conv.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/features/features.2/conv/conv.2/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_265_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 1, 1, 3, 3" offset="3952" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_265" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/backbone/features/features.2/conv/conv.3/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_317_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="5104" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_317" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/backbone/features/features.2/conv/conv.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.2/conv/conv.3/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/backbone/features/features.2/conv/conv.6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/features/features.2/conv/conv.6/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx::Conv_934_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 64, 1, 1" offset="5232" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="onnx::Conv_934" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_934">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/backbone/features/features.2/conv/conv.7/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Reshape_334_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="8304" size="48" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_334" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/backbone/features/features.2/conv/conv.7/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.2/conv/conv.7/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="onnx::Conv_937_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="72, 24, 1, 1" offset="8352" size="3456" />
			<output>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Conv_937" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_937">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/backbone/features/features.3/conv/conv.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_350_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 72, 1, 1" offset="11808" size="144" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_350" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/backbone/features/features.3/conv/conv.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.3/conv/conv.0/Conv_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/backbone/features/features.3/conv/conv.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/features/features.3/conv/conv.2/Relu_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Reshape_362_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="72, 1, 1, 3, 3" offset="11952" size="1296" />
			<output>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_362" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/backbone/features/features.3/conv/conv.3/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_414_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 72, 1, 1" offset="13248" size="144" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_414" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/backbone/features/features.3/conv/conv.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.3/conv/conv.3/Conv_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/backbone/features/features.3/conv/conv.6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/features/features.3/conv/conv.6/Relu_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="onnx::Conv_943_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 72, 1, 1" offset="13392" size="3456" />
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx::Conv_943" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_943">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/backbone/features/features.3/conv/conv.7/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Reshape_431_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="16848" size="48" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_431" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone/features/features.3/conv/conv.7/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.3/conv/conv.7/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/backbone/features/features.3/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.3/Add_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="onnx::Conv_946_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="72, 24, 1, 1" offset="16896" size="3456" />
			<output>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx::Conv_946" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_946">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/backbone/features/features.4/conv/conv.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_448_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 72, 1, 1" offset="20352" size="144" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Reshape_448" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone/features/features.4/conv/conv.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.4/conv/conv.0/Conv_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/features/features.4/conv/conv.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/features/features.4/conv/conv.2/Relu_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Reshape_460_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="72, 1, 1, 5, 5" offset="20496" size="3600" />
			<output>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Reshape_460" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/backbone/features/features.4/conv/conv.3/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_512_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 72, 1, 1" offset="24096" size="144" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_512" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/backbone/features/features.4/conv/conv.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.4/conv/conv.3/Conv_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Range_530" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="24240" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/features/features.4/conv/conv.5/avg_pool/GlobalAveragePool" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.4/conv/conv.5/avg_pool/GlobalAveragePool_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/backbone/features/features.4/conv/conv.5/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="24256" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/backbone/features/features.4/conv/conv.5/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/backbone/features/features.4/conv/conv.5/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.4/conv/conv.5/Reshape_output_0">
					<dim>1</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="features.4.conv.5.fc.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 72" offset="24272" size="3456" />
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="features.4.conv.5.fc.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="features.4.conv.5.fc.0.weight">
					<dim>24</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/backbone/features/features.4/conv/conv.5/fc/fc.0/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_5972_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24" offset="27728" size="48" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_5972" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/backbone/features/features.4/conv/conv.5/fc/fc.0/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/features/features.4/conv/conv.5/fc/fc.0/Gemm_output_0">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/backbone/features/features.4/conv/conv.5/fc/fc.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/features/features.4/conv/conv.5/fc/fc.1/Relu_output_0">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="features.4.conv.5.fc.2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="72, 24" offset="27776" size="3456" />
			<output>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="features.4.conv.5.fc.2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="features.4.conv.5.fc.2.weight">
					<dim>72</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/backbone/features/features.4/conv/conv.5/fc/fc.2/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_5973_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 72" offset="31232" size="144" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_5973" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
